# Підключаємо Flask для створення сервера та request для читання адресного рядка
from flask import Flask, request

# Створюємо саму програму (наш веб-сервер)
app = Flask(__name__)

# Завдання [Easy]: Якщо хтось зайде на головну сторінку "/", сервер віддасть текст "Hello World!"
@app.route('/', methods=['GET'])
def hello_world():
    return "Hello World!"

# Завдання [Easy-Medium]: Обробка сторінки "/currency"
@app.route('/currency', methods=['GET'])
def get_currency():
    # Беремо параметри з посилання (те, що йде після знака питання, наприклад today та key)
    # request.args.get() шукає потрібне слово в URL і бере його значення
    param_today = request.args.get('today')
    param_key = request.args.get('key')
    
    # За завданням поки що просто повертаємо фіксований текст із курсом валют
    return "USD - 41.5"

# Ця умова перевіряє, що ми запускаємо саме цей файл, а не імпортуємо його кудись
if __name__ == '__main__':
    # Запускаємо сервер, щоб він працював і чекав на підключення
    # host='127.0.0.1' означає, що сервер доступний тільки на цьому комп'ютері (локально)
    # port=8000 - це порт, який вимагали у завданні
    app.run(host='127.0.0.1', port=8000)
